# Data Analysis Basic Concepts using Pandas

In [7]:
import pandas as pd

In [8]:
dict1={'Name':['Akshay','Rohit','Shivraj','Sakshi','Sagar','Guru','Ram','Komal'],
      'Marks':[95,79,67,94,90,85,94,90],
      'Gender':['Male','Male','Male','Female','Male','Male','Male','Female']
        }
df1= pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0   Akshay     95    Male
1    Rohit     79    Male
2  Shivraj     67    Male
3   Sakshi     94  Female
4    Sagar     90    Male
5     Guru     85    Male
6      Ram     94    Male
7    Komal     90  Female

In [9]:
# Top 3 rows of Dataset
df1.head(3)

      Name  Marks Gender
0   Akshay     95   Male
1    Rohit     79   Male
2  Shivraj     67   Male

In [10]:
# Check last 3 rows of datset
df1.tail(3)

    Name  Marks  Gender
5   Guru     85    Male
6    Ram     94    Male
7  Komal     90  Female

In [11]:
#find out no. of rows and no. of columns ie. shape
df1.shape

(8, 3)

In [12]:
print('Number of rows',df1.shape[0])
print('Number of Columns',df1.shape[1])

Number of rows 8
Number of Columns 3

In [13]:
#Get Information about our Dataset
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Marks   8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [14]:
#Check null values in dataset
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [15]:
#Get overall Statistics about Dataframe
df1.describe(include='all')

         Name      Marks Gender
count       8   8.000000      8
unique      8        NaN      2
top     Rohit        NaN   Male
freq        1        NaN      6
mean      NaN  86.750000    NaN
std       NaN   9.617692    NaN
min       NaN  67.000000    NaN
25%       NaN  83.500000    NaN
50%       NaN  90.000000    NaN
75%       NaN  94.000000    NaN
max       NaN  95.000000    NaN

In [16]:
#Find Unique Values
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [17]:
#Find Number of Unique Values
df1["Gender"].nunique()

2

In [18]:
#Count Of Unique Columns
df1["Gender"].value_counts()

Male      6
Female    2
Name: Gender, dtype: int64

In [19]:
#Finding the students whose marks between 90 to 100
df1[df1["Marks"]>=90]

     Name  Marks  Gender
0  Akshay     95    Male
3  Sakshi     94  Female
4   Sagar     90    Male
6     Ram     94    Male
7   Komal     90  Female

In [20]:
#Finding the students whose marks between 90 to 100 by using Between method
df1[df1['Marks'].between(90,100)]

     Name  Marks  Gender
0  Akshay     95    Male
3  Sakshi     94  Female
4   Sagar     90    Male
6     Ram     94    Male
7   Komal     90  Female

In [21]:
#Finding total no. of students whose marks between 90 to 100 by using Between method
sum(df1['Marks'].between(90,100))

5

In [22]:
#Find average Marks
df1['Marks'].mean()

86.75

In [31]:
#Apply Method
def marks(x):
    return x//2

In [32]:
df1['Half-marks'] =df1['Marks'].apply(marks)

In [33]:
df1

      Name  Marks  Gender  Half-marks
0   Akshay     95    Male          47
1    Rohit     79    Male          39
2  Shivraj     67    Male          33
3   Sakshi     94  Female          47
4    Sagar     90    Male          45
5     Guru     85    Male          42
6      Ram     94    Male          47
7    Komal     90  Female          45

In [34]:
df1['Marks'].apply(lambda x:x/2)

0    47.5
1    39.5
2    33.5
3    47.0
4    45.0
5    42.5
6    47.0
7    45.0
Name: Marks, dtype: float64

In [35]:
df1['Name'].apply(len)

0    6
1    5
2    7
3    6
4    5
5    4
6    3
7    5
Name: Name, dtype: int64

In [36]:
#Map Function
df1

      Name  Marks  Gender  Half-marks
0   Akshay     95    Male          47
1    Rohit     79    Male          39
2  Shivraj     67    Male          33
3   Sakshi     94  Female          47
4    Sagar     90    Male          45
5     Guru     85    Male          42
6      Ram     94    Male          47
7    Komal     90  Female          45

In [38]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [39]:
df1

      Name  Marks  Gender  Half-marks  Male_Female
0   Akshay     95    Male          47            1
1    Rohit     79    Male          39            1
2  Shivraj     67    Male          33            1
3   Sakshi     94  Female          47            0
4    Sagar     90    Male          45            1
5     Guru     85    Male          42            1
6      Ram     94    Male          47            1
7    Komal     90  Female          45            0

In [40]:
#Drop the columns 
df1

      Name  Marks  Gender  Half-marks  Male_Female
0   Akshay     95    Male          47            1
1    Rohit     79    Male          39            1
2  Shivraj     67    Male          33            1
3   Sakshi     94  Female          47            0
4    Sagar     90    Male          45            1
5     Guru     85    Male          42            1
6      Ram     94    Male          47            1
7    Komal     90  Female          45            0

In [41]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half-marks
0   Akshay     95    Male          47
1    Rohit     79    Male          39
2  Shivraj     67    Male          33
3   Sakshi     94  Female          47
4    Sagar     90    Male          45
5     Guru     85    Male          42
6      Ram     94    Male          47
7    Komal     90  Female          45

In [42]:
df1.drop(['Male_Female','Half-marks'],axis=1)

      Name  Marks  Gender
0   Akshay     95    Male
1    Rohit     79    Male
2  Shivraj     67    Male
3   Sakshi     94  Female
4    Sagar     90    Male
5     Guru     85    Male
6      Ram     94    Male
7    Komal     90  Female

In [43]:
#Print name of the columns
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half-marks', 'Male_Female'], dtype='object')

In [44]:
df1.index

RangeIndex(start=0, stop=8, step=1)

In [46]:
#Sort the dataframe as per the marks columns
df1

      Name  Marks  Gender  Half-marks  Male_Female
0   Akshay     95    Male          47            1
1    Rohit     79    Male          39            1
2  Shivraj     67    Male          33            1
3   Sakshi     94  Female          47            0
4    Sagar     90    Male          45            1
5     Guru     85    Male          42            1
6      Ram     94    Male          47            1
7    Komal     90  Female          45            0

In [47]:
df1.sort_values(by='Marks')

      Name  Marks  Gender  Half-marks  Male_Female
2  Shivraj     67    Male          33            1
1    Rohit     79    Male          39            1
5     Guru     85    Male          42            1
4    Sagar     90    Male          45            1
7    Komal     90  Female          45            0
3   Sakshi     94  Female          47            0
6      Ram     94    Male          47            1
0   Akshay     95    Male          47            1

In [48]:
#Display Name & Marks of Female Students
df1

      Name  Marks  Gender  Half-marks  Male_Female
0   Akshay     95    Male          47            1
1    Rohit     79    Male          39            1
2  Shivraj     67    Male          33            1
3   Sakshi     94  Female          47            0
4    Sagar     90    Male          45            1
5     Guru     85    Male          42            1
6      Ram     94    Male          47            1
7    Komal     90  Female          45            0

In [51]:
df1[df1['Gender']=='Female'][['Name','Marks']]

     Name  Marks
3  Sakshi     94
7   Komal     90